[{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 1, 7, 17], "sparse": false, "input_dtype": "float32", "name": "input_1"}, "name": "input_1"}, {"class_name": "Convolution2D", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"W_constraint": null, "b_constraint": null, "name": "convolution2d_1", "activity_regularizer": null, "trainable": true, "dim_ordering": "th", "nb_col": 17, "subsample": [1, 1], "init": "glorot_uniform", "bias": true, "nb_filter": 8, "b_regularizer": null, "W_regularizer": null, "nb_row": 2, "activation": "linear", "border_mode": "valid"}, "name": "convolution2d_1"}, {"class_name": "Activation", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "config": {"activation": "sigmoid", "trainable": true, "name": "activation_1"}, "name": "activation_1"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_1", 0, 0]]], "config": {"name": "maxpooling2d_1", "trainable": true, "dim_ordering": "tf", "pool_size": [1, 2], "strides": [1, 2], "border_mode": "valid"}, "name": "maxpooling2d_1"}, {"class_name": "Flatten", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "config": {"trainable": true, "name": "flatten_1"}, "name": "flatten_1"}], "input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["flatten_1", 0, 0]]}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 24, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 8}}, {"class_name": "Dropout", "config": {"p": 0.5, "trainable": true, "name": "dropout_1"}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_2"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": 8, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 1}}, {"class_name": "Activation", "config": {"activation": "sigmoid", "trainable": true, "name": "activation_3"}}]